src/xiaofang.Dispatch-Append-Group.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns="urn:xiaofang">
 <SOAP-ENV:Body  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:Dispatch-Append-Group>
   <session-id></session-id>
   <group>
    <id></id>
    <name></name>
    <owner-id></owner-id>
    <number></number>
    <short-number></short-number>
    <participants>
     <account>
      <id></id>
      <name></name>
      <parentid></parentid>
      <entity-type>UNIT</entity-type>
     </account>
     <priority></priority>
     <call-privilege>CallForbid</call-privilege>
     <token-privilege>TokenForbid</token-privilege>
     <status>IDLE</status>
    </participants>
    <participants>
     <account>
      <id></id>
      <name></name>
      <parentid></parentid>
      <entity-type>UNIT</entity-type>
     </account>
     <priority></priority>
     <call-privilege>CallForbid</call-privilege>
     <token-privilege>TokenForbid</token-privilege>
     <status>IDLE</status>
    </participants>
    <size></size>
    <record-type>DontRecord</record-type>
    <record-status>RecordStop</record-status>
   </group>
  </ns:Dispatch-Append-Group>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
